Revit 2024 API
ViewCropRegionShapeManager.GetSplitRegionOffset Method
 Returns the offset for the specified split crop region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public XYZ GetSplitRegionOffset(
	int regionIndex
)
Visual Basic
Public Function GetSplitRegionOffset ( _
	regionIndex As Integer _
) As XYZ
Visual C++
public:
XYZ^ GetSplitRegionOffset(
	int regionIndex
)
Parameters
regionIndex
Type: System.Int32
 Index of the split crop region (numbering starts with 0).
Return Value
 A vector in model space representing the offset which is applied to the split crop region's boundary.
Remarks
 The points in the split crop region's boundary are not in model space. Add the offset returned by this method to each point in the crop region's boundary to transform the points into model space coordinates.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The provided region index is invalid.
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace